---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeHasRightSupport
source: html/23c00d96-0789-5240-661f-8665049729ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeHasRightSupport Property

"Right Support":

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeHasRightSupport { get; }
```